
#赋值运算符

#比较（关系）运算符:
# >= :大于或等于(注意！注意！！)
# >>> 1>=1
# True
# >>> 1>1
# False
###一个小测试：
# >>> b=1
# >>> b+=b>=1  #先比较，再赋值；b>=1结果为True，int(True)=1
# >>> b
# 2
# >>> b=1
# >>> b=b+(b>=1)
# >>> b
# 2
#字符也可以做比较运算
# >>> 'a' > 'b'
# False
# >>> ord('a')
# 97
# >>> ord('b')
# 98
# >>> 'abc' < 'abd'
# True
# >>> 'bac' < 'aac'
# False
###元祖也可以做比较运算
# >>> (1,2,3) > (1,3,3)
# False
# ###列表也可以做比较运算
# >>> [1,2,3] < [1,3,3]
# True
# ###集合也可以做比较运算
# >>> {1,2,3} == {1,3,2}
# True
# ###字典也可以做比较运算，无序、key：value都相同才是相等；
# >>> {1:'a',2:'b'} == {2:'b',1:'a'}
# True
# >>> {1:'a',2:'b'} == {4:'b',3:'a'}
# False
# >>>