
#逻辑运算符:对布尔类型进行运算,返回布尔值;运算可以是非布尔类型，结果也可以是非布尔类型；‘
# 1.not,and,or;
#and，且（与）；
#or，或；
#not，非；

# 2.顺序:not,and,or

#int,float:0被认为是False，非0被认为是True；
#str,tuple,list,dic：空被认为是False，否则被认为是True；

#  >>> 1 and 1
# 1
# >>> 1 and 2
# 2
# >>> 2 and 1
# 1
# >>> 2 or 1
# 2
# >>> 1 or 2
# 1
# >>> not 2
# False
# >>> 'a' and 'b'
# 'b'
# >>> 'b' and 'a'
# 'a'
# >>> 'a' or 'b'
# 'a'
# >>> 'b' or 'a'
# 'b'
# >>> not 'a'
# False
# >>>
# >>> not ''
# True
# >>>
# >>> 'a' or ''
# 'a'
# >>> '' or 'a'
# 'a'
# >>> 'a' and ''
# ''
# >>> '' and 'a'
# ''
# >>>

# Lambda  #运算优先级最低
# 逻辑运算符: or
# 逻辑运算符: and
# 逻辑运算符:not
# 成员测试: in, not in
# 同一性测试: is, is not
# 比较: <,<=,>,>=,!=,==
# 按位或: |
# 按位异或: ^
# 按位与: &
# 移位: << ,>>
# 加法与减法: + ,-
# 乘法、除法与取余: *, / ,%
# 正负号: +x,-x

# #优先级第一名 - 函数调用、寻址、下标  
  
# #优先级第二名 - 幂运算 **  
# a = 4*2**3  
# print a  
  
# #优先级第三名 - 翻转运算符 ~  
# print ~a  
  
# #第四名 - 正负号  
# print 2+4*-2  
  
# #第五名 - *、/、%  
# print 2+4*2/2  
  
# #第六名 - +、-  
# print 3<<2+1 #先执行加法，在左移  
  
# #第七名 - << 、 >>  
# #参见上面  
  
# #第八名 - 位操作符 & 、 | 、 ^  
  
# #第九名 - 比较运算符  
# a = 2*3+5 <= 5+1*3  
# print a  
  
# #第十名 - 逻辑运算符 not 、 and 、or  
  
# #第十一名 lambda表达式  