
#组，python中有多种表示组的数据类型：str、list、tuple、set、dic。

#列表(list),元素可以是不同类型
print(type([1,2,3,True,'4','abc',[4,5,6],False]))
#嵌套列表，二维数组；(如何访问‘里层’的元素呢)

#列表的基本操作：
a = ["新月打击","苍白之瀑","月之降临","月神冲刺"]
b = [1,2,3,4,5,6]
c = [[1,2,3],[4,5,6],[7,8,9]]
print(a[0])  #注意：用索引访问时，结果是单个元素
print(b[0])
print(a[3])
print(a[0:2]) #注意：用冒号方式访问时结果是列表
print(a[-1:]) 
print(a[-1])  
#列表加法操作
print(a+b)
print(b+[7,8])
#列表乘法操作
print(b*2) #将元素重复，不支持两个列表相乘。
#不支持减法操作
#print(b-[5,6])
print(c[0])
print(c[1][0:2])
print(c[-1][0:3])
print(c[-2][-2])